#Если Сервер Тогда
	
#Область ОписаниеПеременных

Перем СОД_БезРегистрации Экспорт;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ОстаткиТоваров
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары из Товары Цикл
		
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Стоимость = ТекСтрокаТовары.Количество * ТекСтрокаТовары.Сумма;
	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область Инициализация

СОД_БезРегистрации = Ложь;

#КонецОбласти

#КонецЕсли