////////////////////////////////////////////////////////////////////////////////
// Клиентские процедуры и функции общего назначения:
// - для работы со списками в формах;
// - для работы с журналом регистрации;
// - для обработки действий пользователя в процессе редактирования
//   многострочного текста, например комментария в документах;
// - прочее.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция СоздаватьФайлLog() Экспорт 

	Возврат Константы.СОД_СоздаватьФайлLog.Получить();
	
КонецФункции

Функция ПутьККаталогуФайлаLog() Экспорт
	
	Возврат Константы.СОД_ПутьККаталогуФайлаLog.Получить();
	
КонецФункции 

Функция ВключитьПротоколОбменаРегистрациями() Экспорт
	
	Возврат Константы.СОД_ВключитьПротоколОбменаРегистрациями.Получить();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьИмяБазы() Экспорт

	Строка = СтрокаСоединенияИнформационнойБазы(); 
	Индекс = СтрНайти(Строка, "Ref=");
	
	Возврат Сред(Строка, Индекс + 5, СтрДлина(Строка) - Индекс - 5 - 1);
	
КонецФункции

Функция ПолучитьФорматСообщенияУзла(Узел) Экспорт
	
	Возврат Узел.ФорматСообщения;
	
КонецФункции

Функция ПолучитьКодУзла(Узел) Экспорт
	
	Возврат Узел.Код;
	
КонецФункции

#КонецОбласти