////////////////////////////////////////////////////////////////////////////////
// Клиентские процедуры и функции общего назначения:
// - для работы со списками в формах;
// - для работы с журналом регистрации;
// - для обработки действий пользователя в процессе редактирования
//   многострочного текста, например комментария в документах;
// - прочее.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура СообщитьПользователю(Текст) Экспорт
			
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = Текст;
							
	Сообщение.Сообщить();	
			
КонецПроцедуры

#КонецОбласти