#Область ОбработчикиСобытий

Функция RunPost(Запрос)
	
	// тестирование соединения
	
	Данные = Запрос.ПолучитьТелоКакСтроку();
	
	СОД_Синхронизация.ДобавитьПротоколОбменаРегистрациями(Истина, Данные);
	
	Если Не ЗначениеЗаполнено(Данные) Тогда
		Возврат Новый HTTPСервисОтвет(200);
	КонецЕсли;
	
	// обработка запроса
	
	СОД_Обмен = СОД_Синхронизация.ПолучитьМодульСистемы();
	СОД_Обмен.Инициализировать(СОД_Маршрутизация.ОбработкаОтладкиПравил());
	
	СОД_Обмен.ЗаписатьСообщение(Данные);
	
	СОД_Обмен.МодульПравил = Неопределено;
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти