#Если Сервер Тогда
	
#Область ОписаниеПеременных

Перем МодульСистемы Экспорт;

Перем СоответствиеМетаданных Экспорт;
Перем СоответствиеРегистраций Экспорт;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// ПЕРЕЧИСЛЕНИЯ

Функция Перечисление_ТЕСТ_СтавкаНДС_Чтение(Ссылка, Ключи = Ложь, Метод = Неопределено) Экспорт

	Возврат ЗаполнениеСтандартнойСтруктурыОбъекта(Ссылка, Ключи, Метод);

КонецФункции

Функция Перечисление_ТЕСТ_СтавкаНДС_Запись(ЭтаСтруктура, Поиск = Ложь, Метод = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ЭтаСтруктура.Значение) Тогда
		ВызватьИсключение "Операция прервана ! Не заполнено значение объекта !";
	КонецЕсли;
	
	УстановитьБезопасныйРежим(Истина);
	ЭтиДанные = Вычислить("Перечисления.ТЕСТ_СтавкаНДС." + ЭтаСтруктура.Значение);
	УстановитьБезопасныйРежим(Ложь);
		
	Возврат ЭтиДанные;
	
КонецФункции
	
// СПРАВОЧНИКИ

Функция Справочник_ТЕСТ_Номенклатура_Чтение(Ссылка, Ключи = Ложь, Метод = Неопределено) Экспорт
	
	Возврат ЗаполнениеСтандартнойСтруктурыОбъекта(Ссылка, Ключи, Метод); 		
	
КонецФункции

Функция Справочник_ТЕСТ_Номенклатура_Запись(ЭтаСтруктура, Поиск = Ложь, Метод = Неопределено) Экспорт
	
	Возврат ЧтениеСтандартнойСтруктурыСправочник(ЭтаСтруктура, Поиск, Метод);
					
КонецФункции

Функция Справочник_ТЕСТ_ВидыНоменклатуры_Чтение(Ссылка, Ключи = Ложь, Метод = Неопределено) Экспорт
	
	Возврат ЗаполнениеСтандартнойСтруктурыОбъекта(Ссылка, Ключи, Метод);	
	
КонецФункции

Функция Справочник_ТЕСТ_ВидыНоменклатуры_Запись(ЭтаСтруктура, Поиск = Ложь, Метод = Неопределено) Экспорт
	
	Возврат ЧтениеСтандартнойСтруктурыСправочник(ЭтаСтруктура, Поиск, Метод);
	
КонецФункции

// СПРАВОЧНИКИ: РЕГИСТРАЦИИ

Функция Справочник_ТЕСТ_Номенклатура_Регистрация(Ссылка, Метод = Неопределено) Экспорт
	
	Возврат Не Ссылка.СОД_БезРегистрации; 

КонецФункции

Функция Справочник_ТЕСТ_ВидыНоменклатуры_Регистрация(Ссылка, Метод = Неопределено) Экспорт

	Возврат Не Ссылка.СОД_БезРегистрации; 

КонецФункции

// ДОКУМЕНТЫ

Функция Документ_ТЕСТ_ПриходныйОрдер_Чтение(Ссылка, Ключи = Ложь, Метод = Неопределено) Экспорт
	
	Возврат ЗаполнениеСтандартнойСтруктурыОбъекта(Ссылка, Ключи, Метод); 		
	
КонецФункции

Функция Документ_ТЕСТ_ПриходныйОрдер_Запись(ЭтаСтруктура, Поиск = Ложь, Метод = Неопределено) Экспорт
					
	Возврат ЧтениеСтандартнойСтруктурыДокумент(ЭтаСтруктура, Поиск, Метод);

КонецФункции

// ДОКУМЕНТЫ: РЕГИСТРАЦИИ

Функция Документ_ТЕСТ_ПриходныйОрдер_Регистрация(Ссылка, Метод = Неопределено) Экспорт
	
	Возврат Не Ссылка.СОД_БезРегистрации; 

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаполнениеСтандартнойСтруктурыОбъекта(Ссылка, Ключи, Метод)

	ЭтаСтруктура = Новый Структура;

	Структура = МодульСистемы.ПолучитьПолнуюСсылку(Ссылка);

	ЭтаСтруктура.Вставить("Ссылка", Структура);

	Если Не Структура.Группа = "Перечисление" Тогда
		Если Ключи Тогда
			ЭтаСтруктура.Вставить("ИНС_ВнешнийКлюч", Ссылка.ИНС_ВнешнийКлюч);
		Иначе
			МодульСистемы.ЗаполнитьУниверсальнуюСтруктуру(Ссылка, ЭтаСтруктура);
		КонецЕсли;
	КонецЕсли;

	ЭтаСтруктура.Ссылка.Вставить("Метод", Метод);

	Возврат ЭтаСтруктура;	

КонецФункции

Функция ЧтениеСтандартнойСтруктурыСправочник(ЭтаСтруктура, Поиск, Метод)

	Ссылка = Справочники[ЭтаСтруктура.Ссылка.Имя].НайтиПоРеквизиту("ИНС_ВнешнийКлюч", ЭтаСтруктура.ИНС_ВнешнийКлюч);

	Если Поиск Тогда
		Возврат Ссылка;
	КонецЕсли;

	Если Ссылка.Пустая() Тогда

		Если ЭтаСтруктура.ЭтоГруппа Тогда
			ЭтиДанные = Справочники[ЭтаСтруктура.Ссылка.Имя].СоздатьГруппу();
		Иначе
			ЭтиДанные = Справочники[ЭтаСтруктура.Ссылка.Имя].СоздатьЭлемент();
		КонецЕсли;

		ЭтиДанные.УстановитьСсылкуНового(Ссылка);

	Иначе
		ЭтиДанные = Ссылка.ПолучитьОбъект();
	КонецЕсли;

	МодульСистемы.ПрочитатьУниверсальнуюСтруктуру(ЭтиДанные, ЭтаСтруктура);

	ЭтиДанные.СОД_БезРегистрации = Истина;

	ЭтиДанные.Записать();

	Возврат ЭтиДанные.Ссылка;

КонецФункции

Функция ЧтениеСтандартнойСтруктурыДокумент(ЭтаСтруктура, Поиск, Метод)

	Ссылка = Документы[ЭтаСтруктура.Ссылка.Имя].НайтиПоРеквизиту("ИНС_ВнешнийКлюч", ЭтаСтруктура.ИНС_ВнешнийКлюч);

	Если Поиск Тогда
		Возврат Ссылка;
	КонецЕсли;

	Если Ссылка.Пустая() Тогда

		ЭтиДанные = Документы[ЭтаСтруктура.Ссылка.Имя].СоздатьДокумент();

		ЭтиДанные.УстановитьСсылкуНового(Ссылка);

	Иначе
		ЭтиДанные = Ссылка.ПолучитьОбъект();
	КонецЕсли;

	МодульСистемы.ПрочитатьУниверсальнуюСтруктуру(ЭтиДанные, ЭтаСтруктура);

	ЭтиДанные.СОД_БезРегистрации = Истина;

	РежимЗаписи = МодульСистемы.РежимЗаписи(ЭтиДанные, ЭтаСтруктура);
	ЭтиДанные.Записать(РежимЗаписи, РежимПроведенияДокумента.Неоперативный);

	Возврат ЭтиДанные.Ссылка;
	
КонецФункции

#КонецОбласти

#Область Инициализация

СоответствиеМетаданных = Новый Соответствие;

СоответствиеМетаданных["Перечисление_ТЕСТ_СтавкаНДС"]	= "МодульПравил.Перечисление_ТЕСТ_СтавкаНДС";
СоответствиеМетаданных["Справочник_ТЕСТ_Номенклатура"]	= "МодульПравил.Справочник_ТЕСТ_Номенклатура";
СоответствиеМетаданных["Справочник_ТЕСТ_ВидыНоменклатуры"]	= "МодульПравил.Справочник_ТЕСТ_ВидыНоменклатуры";
СоответствиеМетаданных["Документ_ТЕСТ_ПриходныйОрдер"]	= "МодульПравил.Документ_ТЕСТ_ПриходныйОрдер";

СоответствиеРегистраций = Новый Соответствие;

СоответствиеРегистраций["Справочник_ТЕСТ_Номенклатура"]	= Новый Структура("ИмяМетодаРегистрации, Включен", "МодульПравил.Справочник_ТЕСТ_Номенклатура", Истина);
СоответствиеРегистраций["Справочник_ТЕСТ_ВидыНоменклатуры"]	= Новый Структура("ИмяМетодаРегистрации, Включен", "МодульПравил.Справочник_ТЕСТ_ВидыНоменклатуры", Истина);
СоответствиеРегистраций["Документ_ТЕСТ_ПриходныйОрдер"]	= Новый Структура("ИмяМетодаРегистрации, Включен", "МодульПравил.Документ_ТЕСТ_ПриходныйОрдер", Истина);

#КонецОбласти

#КонецЕсли