Функция СоздаватьФайлLog() Экспорт 

	Возврат Константы.СОД_СоздаватьФайлLog.Получить();
	
КонецФункции

Функция ПутьККаталогуФайлаLog() Экспорт
	
	Возврат Константы.СОД_ПутьККаталогуФайлаLog.Получить();
	
КонецФункции 

Функция ВключитьПротоколОбменаРегистрациями() Экспорт
	
	Возврат Константы.СОД_ВключитьПротоколОбменаРегистрациями.Получить();
	
КонецФункции

Функция ПолучитьИмяБазы() Экспорт

	Строка = СтрокаСоединенияИнформационнойБазы(); 
	Индекс = СтрНайти(Строка, "Ref=");
	
	Возврат Сред(Строка, Индекс + 5, СтрДлина(Строка) - Индекс - 5 - 1);
	
КонецФункции