#Если Сервер Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьПредставлениеHTTP(Узел) Экспорт

	Возврат "http://" + Узел.HTTPСервер + ":" + Формат(Узел.HTTPПорт, "ЧГ=0") + "/" + Узел.HTTPБазаДанных + "/hs/" + Узел.HTTPИмяСервиса + "/run";
	
КонецФункции    

Функция ПолучитьПредставлениеSOAP(Узел) Экспорт

	Возврат "http://" + Узел.WEBСервер + ":" + Формат(Узел.WEBПорт, "ЧГ=0") + "/" + Узел.WEBБазаДанных + "/ws/sed_web.1cws?wsdl";
	
КонецФункции  

Функция ПолучитьОбязательныеРеквизитыHTTP() Экспорт

	Массив = Новый Массив;
	Массив.Добавить("HTTPСервер");
	Массив.Добавить("HTTPПорт");
	Массив.Добавить("HTTPБазаДанных");
	Массив.Добавить("HTTPИмяСервиса");
	
	Возврат Массив;
	
КонецФункции 

Функция ПолучитьОбязательныеРеквизитыSOAP() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить("WEBСервер");
	Массив.Добавить("WEBПорт");
	Массив.Добавить("WEBБазаДанных");
	Массив.Добавить("WEBURIПространстваИменСервиса");
	Массив.Добавить("WEBИмяСервиса");
	Массив.Добавить("WEBИмяТочкиПодключения");
	
	Возврат Массив;
	
КонецФункции

#КонецОбласти

#КонецЕсли