Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(HTTPИмяСервиса) Тогда
		HTTPИмяСервиса = "sed-web";
	КонецЕсли;  
	
	Если Не ЗначениеЗаполнено(WEBURIПространстваИменСервиса) Тогда
		WEBURIПространстваИменСервиса = "asrv.r5g.ru";
	КонецЕсли;  
	
	Если Не ЗначениеЗаполнено(WEBИмяСервиса) Тогда
		WEBИмяСервиса = "SED_WEB";
	КонецЕсли;    
	
	Если Не ЗначениеЗаполнено(WEBИмяТочкиПодключения) Тогда
		WEBИмяТочкиПодключения = "SED_WEBSoap";
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ПротоколДоставкиОтправлений = Перечисления.СОД_ПротоколыДоставкиОтправлений.HTTPСервис Тогда
		УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ПланыОбмена.СОД_Узлы.ПолучитьОбязательныеРеквизитыSOAP());
	ИначеЕсли ЭтотОбъект.ПротоколДоставкиОтправлений = Перечисления.СОД_ПротоколыДоставкиОтправлений.WEBСервис Тогда
		УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ПланыОбмена.СОД_Узлы.ПолучитьОбязательныеРеквизитыHTTP());
	Иначе
		УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ПланыОбмена.СОД_Узлы.ПолучитьОбязательныеРеквизитыHTTP());
		УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ПланыОбмена.СОД_Узлы.ПолучитьОбязательныеРеквизитыSOAP());
	КонецЕсли;
	
КонецПроцедуры 

// СЛУЖЕБНЫЕ

Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт

  Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
 
    ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива); 
	
    Если ПорядковыйНомер <> Неопределено Тогда
      МассивРеквизитов.Удалить(ПорядковыйНомер);
    КонецЕсли;
 
  КонецЦикла;
 
КонецПроцедуры
