Функция ОбработкаОтладкиСистемы() Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("Тип", Константы.СОД_ИсточникОтладкиПравил.Получить());
	Структура.Вставить("Источник");
	
	Если Структура.Тип = Перечисления.СОД_ИсточникиОбработкиПравил.ИзФайла Тогда
		Структура.Источник = Константы.СОД_ОбработкаОтладкиСистемы.Получить();
	ИначеЕсли Структура.Тип = Перечисления.СОД_ИсточникиОбработкиПравил.ИзКонфигурации Тогда
		Структура.Источник = "СОД_ОбработкаОтладкиСистемы";
	Иначе
		Структура.Источник = Неопределено;
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции

Функция ОбработкаОтладкиПравил() Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("Тип", Константы.СОД_ИсточникОтладкиПравил.Получить());
	Структура.Вставить("Источник");
	
	Если Структура.Тип = Перечисления.СОД_ИсточникиОбработкиПравил.ИзФайла Тогда
		Структура.Источник = Константы.СОД_ОбработкаОтладкиПравил.Получить();
	ИначеЕсли Структура.Тип = Перечисления.СОД_ИсточникиОбработкиПравил.ИзКонфигурации Тогда
		Структура.Источник = "СОД_ОбработкаОтладкиПравил";
	Иначе
		Структура.Источник = Неопределено;
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции
