
&НаСервере
Процедура УстановитьНаСервере()
	
	Если Не ЗначениеЗаполнено(Узел) Тогда
		СОД_Общий.СообщитьПользователю("Параметр [" + Узел + "] не задан или задан не верно.");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Направление) Тогда
		СОД_Общий.СообщитьПользователю("Параметр [" + Направление + "] не задан или задан не верно.");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Узел", Узел);
	Запрос.УстановитьПараметр("Направление", Направление);
	Запрос.УстановитьПараметр("Отправлено", Отправлено);
	Запрос.УстановитьПараметр("Обработано", Обработано);
	Запрос.УстановитьПараметр("ОбработкаПодтверждена", ОбработкаПодтверждена);
	Запрос.УстановитьПараметр("ИсходящееПодтверждение", ИсходящееПодтверждение);
	Запрос.УстановитьПараметр("ВходящееПодтверждение", ВходящееПодтверждение);
	Запрос.УстановитьПараметр("ВходящаяРегистрация", ВходящаяРегистрация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	СОД_Регистрации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СОД_Регистрации КАК СОД_Регистрации
	               |ГДЕ
	               |	(
				   |	    (СОД_Регистрации.Отправлено 				= ЛОЖЬ) И &Отправлено ИЛИ &ВходящаяРегистрация
	               |	ИЛИ (СОД_Регистрации.Обработано 				= ЛОЖЬ) И &Обработано
	               |	ИЛИ (СОД_Регистрации.ОбработкаПодтверждена 		= ЛОЖЬ) И &ОбработкаПодтверждена
	               |	ИЛИ (СОД_Регистрации.ИсходящееПодтверждение 	= ЛОЖЬ) И &ИсходящееПодтверждение
	               |	ИЛИ (СОД_Регистрации.ВходящееПодтверждение 		= ЛОЖЬ) И &ВходящееПодтверждение
				   |    )
	               |	И СОД_Регистрации.Направление   = &Направление
				   |	И СОД_Регистрации.Узел			= &Узел";
	
	РегистрацииКОбработке = Запрос.Выполнить().Выгрузить()
								.ВыгрузитьКолонку("Ссылка");
								
	Для Каждого РегистрацияСсылка Из РегистрацииКОбработке Цикл
									
		Попытка
			
			РегистрацияОбъект = РегистрацияСсылка.ПолучитьОбъект();
			
			РегистрацияОбъект.Отправлено 				= ?(Отправлено, Истина, РегистрацияОбъект.Отправлено);
			РегистрацияОбъект.Обработано 				= ?(Обработано, Истина, РегистрацияОбъект.Обработано);
			РегистрацияОбъект.ОбработкаПодтверждена 	= ?(ОбработкаПодтверждена, Истина, РегистрацияОбъект.ОбработкаПодтверждена);
			РегистрацияОбъект.ИсходящееПодтверждение 	= ?(ИсходящееПодтверждение, Истина, РегистрацияОбъект.ИсходящееПодтверждение);
			РегистрацияОбъект.ВходящееПодтверждение 	= ?(ВходящееПодтверждение, Истина, РегистрацияОбъект.ВходящееПодтверждение);
			
			РегистрацияОбъект.Записать();
			
		Исключение
			
			Ошибка = ОписаниеОшибки();
			
			Текст = "Не удалось записать регистрацию: " + РегистрацияСсылка + Символы.ПС
				  + Ошибка;
							
			СОД_Общий.СообщитьПользователю(Текст);
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	УстановитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеПриИзменении(Элемент)
	
	ВходящаяРегистрация = Направление = ПредопределенноеЗначение("Перечисление.СОД_НаправлениеРегистрации.Входящее");
	
	Отправлено = ? (ВходящаяРегистрация, Ложь, Отправлено);
	Элементы.Отправлено.Доступность = Не ВходящаяРегистрация;
	
КонецПроцедуры
